Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_79 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
dropout_79 (Dropout)         (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 32, 32, 32)        9248      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 32, 16, 16)        0         
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 64, 16, 16)        18496     
_________________________________________________________________
dropout_80 (Dropout)         (None, 64, 16, 16)        0         
_________________________________________________________________
conv2d_82 (Conv2D)           (None, 64, 16, 16)        36928     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 64, 8, 8)          0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 128, 8, 8)         73856     
_________________________________________________________________
dropout_81 (Dropout)         (None, 128, 8, 8)         0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 128, 8, 8)         147584    
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 128, 4, 4)         0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 2048)              0         
_________________________________________________________________
dropout_82 (Dropout)         (None, 2048)              0         
_________________________________________________________________
dense_40 (Dense)             (None, 1024)              2098176   
_________________________________________________________________
dropout_83 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_41 (Dense)             (None, 512)               524800    
_________________________________________________________________
dropout_84 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 10)                5130      
=================================================================
Total params: 2,915,114
Trainable params: 2,915,114
Non-trainable params: 0
_________________________________________________________________
None
/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:66: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.
Epoch 1/8
8000/8000 [==============================] - 90s 11ms/step - loss: 2.2113 - acc: 0.1703
Epoch 2/8
8000/8000 [==============================] - 87s 11ms/step - loss: 2.0137 - acc: 0.2588
Epoch 3/8
8000/8000 [==============================] - 83s 10ms/step - loss: 1.9381 - acc: 0.2814
Epoch 4/8
8000/8000 [==============================] - 81s 10ms/step - loss: 1.7746 - acc: 0.3384
Epoch 5/8
8000/8000 [==============================] - 79s 10ms/step - loss: 1.6647 - acc: 0.3861
Epoch 6/8
8000/8000 [==============================] - 77s 10ms/step - loss: 1.5900 - acc: 0.4156
Epoch 7/8
8000/8000 [==============================] - 70s 9ms/step - loss: 1.5241 - acc: 0.4398
Epoch 8/8
8000/8000 [==============================] - 69s 9ms/step - loss: 1.4729 - acc: 0.4637
Accuracy: 45.60%